package com.lesson.l7.task.comparable;

/**
 * В таблице есть колонки, по которым можно сортировать.
 * Пользователь имеет возможность настроить под себя список колонок, которые будут сортироваться.
 * Напиши public static компаратор CustomizedComparator, который будет:
 * 1. В конструкторе принимать массив компараторов.
 * 2. Сортировать данные в порядке, соответствующем последовательности компараторов.
 * Все переданные компараторы сортируют дженерик тип Т.
 * В конструктор передается как минимум один компаратор.
 */
public class Main3 {
    public static void main(String[] args) {

    }
}
